zzac9ej/SmartAc/ESP32_SmartAC/ESP32_SmartAC.ino
#include <Arduino.h>
#include <WiFi.h>
#include <PubSubClient.h>
#include <ArduinoJson.h>
#include <esp_task_wdt.h>
#include <esp_system.h>
#include <IRremoteESP8266.h>
#include <IRsend.h>
#include <ir_Kelon.h>

// ============================================================
// ESP32 Kelon AC Controller
// 24/7 Stable + Full Trace Logging Version
//
// API -> MQTT -> ESP32 -> QUEUE -> IR
//
// Features:
// 1. 防快速連點：300ms settle，最後一筆優先
// 2. MQTT callback 不直接發 IR
// 3. 同時支援 command/temperature 與 Action/Temperature
// 4. Wi-Fi 自動恢復
// 5. MQTT 自動恢復
// 6. MQTT socket timeout
// 7. 15 秒 Task Watchdog
// 8. Reset Reason 記錄
// 9. 每 30 秒 Heap / Wi-Fi / MQTT 狀態
// 10. 完整 Trace Log：每筆 MQTT 訊息都有 Sequence ID
// 11. 可選的 requestId / traceId / RequestId / TraceId 追蹤
// 12. IR 發射與狀態碼完整紀錄
// ============================================================

// ============================================================
// Wi-Fi
// ============================================================
const char* ssid = "ice22-1";
const char* password = "19991130";

// ============================================================
// MQTT
// ============================================================
const char* mqtt_server = "broker.hivemq.com";
const uint16_t mqtt_port = 1883;
const char* mqtt_topic = "home/livingroom/ac";

// ============================================================
// Hardware
// ============================================================
const uint16_t kIrLed = 13;

IRKelonAc ac(kIrLed);
IRsend rawSender(kIrLed);

WiFiClient espClient;
PubSubClient client(espClient);

// ============================================================
// Watchdog
// ============================================================
#define WDT_TIMEOUT_SEC 15

// ============================================================
// Timing
// ============================================================
const unsigned long WIFI_CHECK_INTERVAL       = 10000UL;
const unsigned long MQTT_RECONNECT_INTERVAL   = 5000UL;
const unsigned long WIFI_RESTART_TIMEOUT      = 5UL * 60UL * 1000UL;
const unsigned long MQTT_RESTART_TIMEOUT      = 10UL * 60UL * 1000UL;
const unsigned long STATUS_REPORT_INTERVAL    = 30000UL;

// 收到 MQTT 後等待 300ms。
// 如果 300ms 內又收到新溫度，就只執行最後一筆。
const unsigned long COMMAND_SETTLE_MS        = 300UL;

// 兩次 IR 發射至少間隔 800ms。
const unsigned long IR_MIN_INTERVAL_MS       = 800UL;

// 0 = 不使用定期重開。
const unsigned long REBOOT_INTERVAL_MS       = 0UL;

// MQTT payload 最多顯示這麼多 bytes，避免 Serial 爆量。
const size_t MAX_LOG_PAYLOAD = 512;

// ============================================================
// Runtime state
// ============================================================
unsigned long setupTime = 0;
unsigned long lastWiFiCheckTime = 0;
unsigned long lastMqttConnectAttempt = 0;
unsigned long lastStatusReportTime = 0;
unsigned long wifiDisconnectedSince = 0;
unsigned long mqttDisconnectedSince = 0;
unsigned long lastIrSendTime = 0;

// 每收到一筆 MQTT 就增加一次。
uint32_t mqttMessageSeq = 0;

// 每次 IR 發射增加一次。
uint32_t irSendSeq = 0;

// ============================================================
// Pending command
// ============================================================
bool pendingCommandValid = false;
char pendingCommand[16] = {0};
int pendingTemperature = 27;
unsigned long pendingCommandTime = 0;
uint32_t pendingMessageSeq = 0;
char pendingTraceId[64] = {0};

// ============================================================
// Utility
// ============================================================
const char* yesNo(bool value) {
  return value ? "YES" : "NO";
}

void printHex64(uint64_t value) {
  char buffer[32];
  snprintf(buffer, sizeof(buffer), "%016llX", (unsigned long long)value);
  Serial.print(buffer);
}

void copySafeString(char* dest, size_t destSize, const char* src) {
  if (destSize == 0) return;
  if (src == nullptr) {
    dest[0] = '\0';
    return;
  }
  strncpy(dest, src, destSize - 1);
  dest[destSize - 1] = '\0';
}

// ============================================================
// Reset reason
// ============================================================
const char* getResetReasonName(esp_reset_reason_t reason) {
  switch (reason) {
    case ESP_RST_UNKNOWN:    return "UNKNOWN";
    case ESP_RST_POWERON:    return "POWER_ON";
    case ESP_RST_EXT:       return "EXTERNAL_RESET";
    case ESP_RST_SW:        return "SOFTWARE_RESET";
    case ESP_RST_PANIC:     return "PANIC";
    case ESP_RST_INT_WDT:   return "INT_WATCHDOG";
    case ESP_RST_TASK_WDT:  return "TASK_WATCHDOG";
    case ESP_RST_WDT:       return "OTHER_WATCHDOG";
    case ESP_RST_DEEPSLEEP: return "DEEP_SLEEP";
    case ESP_RST_BROWNOUT:  return "BROWNOUT";
    case ESP_RST_SDIO:      return "SDIO";
    default:                return "OTHER";
  }
}

void printResetReason() {
  esp_reset_reason_t reason = esp_reset_reason();

  Serial.println();
  Serial.println("============================================================");
  Serial.println("[BOOT] RESET INFORMATION");
  Serial.println("------------------------------------------------------------");
  Serial.print("[BOOT] Reset code   : ");
  Serial.println((int)reason);
  Serial.print("[BOOT] Reset reason : ");
  Serial.println(getResetReasonName(reason));
  Serial.print("[BOOT] Free heap    : ");
  Serial.print(ESP.getFreeHeap());
  Serial.println(" bytes");
  Serial.print("[BOOT] Min heap     : ");
  Serial.print(ESP.getMinFreeHeap());
  Serial.println(" bytes");
  Serial.print("[BOOT] Chip revision: ");
  Serial.println(ESP.getChipRevision());
  Serial.print("[BOOT] CPU          : ");
  Serial.print(ESP.getCpuFreqMHz());
  Serial.println(" MHz");
  Serial.println("============================================================");
}

// ============================================================
// Watchdog
// ============================================================
void initWatchdog() {
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_task_wdt_config_t wdt_config = {
    .timeout_ms = WDT_TIMEOUT_SEC * 1000,
    .idle_core_mask = 0,
    .trigger_panic = true
  };
  esp_task_wdt_init(&wdt_config);
#else
  esp_task_wdt_init(WDT_TIMEOUT_SEC, true);
#endif

  esp_task_wdt_add(NULL);
}

