zzac9ej/SmartAc/ESP32_SmartAC/ESP32_SmartAC.ino
// ============================================================
// Kelon IR waveform
// ============================================================
void sendCustomKelon(uint64_t data) {
  uint32_t currentIrSeq = ++irSendSeq;

  Serial.println();
  Serial.println("------------------------------------------------------------");
  Serial.print("[IR][#");
  Serial.print(currentIrSeq);
  Serial.println("] TRANSMIT START");

  Serial.print("[IR][#");
  Serial.print(currentIrSeq);
  Serial.print("] GPIO        = ");
  Serial.println(kIrLed);

  Serial.print("[IR][#");
  Serial.print(currentIrSeq);
  Serial.print("] Frequency   = 38 kHz");
  Serial.println();

  Serial.print("[IR][#");
  Serial.print(currentIrSeq);
  Serial.print("] State       = 0x");
  printHex64(data);
  Serial.println();

  unsigned long start = millis();

  rawSender.enableIROut(38);

  // Header
  rawSender.mark(7318);
  rawSender.space(3758);

  // 48-bit
  for (int i = 0; i < 48; i++) {
    rawSender.mark(530);

    if ((data >> i) & 1ULL) {
      rawSender.space(1294);
    } else {
      rawSender.space(512);
    }

    if ((i & 0x0F) == 0) {
      esp_task_wdt_reset();
    }
  }

  // Footer
  rawSender.mark(530);
  rawSender.space(0);

  unsigned long elapsed = millis() - start;

  Serial.print("[IR][#");
  Serial.print(currentIrSeq);
  Serial.print("] TRANSMIT DONE | elapsed = ");
  Serial.print(elapsed);
  Serial.println(" ms");
  Serial.println("------------------------------------------------------------");
}

// ============================================================
// AC state
// ============================================================
uint64_t getAcState(const char* command, int temp) {
  if (strcmp(command, "turn_off") == 0) {
    return 0x1C000077590EULL;
  }

  if (strcmp(command, "turn_on") == 0) {
    if (temp < 18) temp = 18;
    if (temp > 32) temp = 32;

    uint64_t base = 0x00000077000EULL;
    uint64_t byte5 = (uint64_t)(temp + 4) << 40;
    uint64_t byte1 = (uint64_t)(temp + 155) << 8;

    return base | byte5 | byte1;
  }

  return 0x1C000077590EULL;
}

// ============================================================
// Queue command
// ============================================================
void queueCommand(const char* command,
                  int temp,
                  uint32_t messageSeq,
                  const char* traceId) {

  // 最後一筆優先。
  copySafeString(pendingCommand, sizeof(pendingCommand), command);

  if (strcmp(command, "turn_on") == 0) {
    pendingTemperature = constrain(temp, 18, 32);
  } else {
    pendingTemperature = temp;
  }

  pendingCommandTime = millis();
  pendingMessageSeq = messageSeq;
  copySafeString(pendingTraceId, sizeof(pendingTraceId), traceId);
  pendingCommandValid = true;

  Serial.println();
  Serial.println("[QUEUE] --------------------------------------------------");
  Serial.print("[QUEUE] MQTT message #");
  Serial.print(messageSeq);
  Serial.println(" queued");
  Serial.print("[QUEUE] Command     = ");
  Serial.println(pendingCommand);
  Serial.print("[QUEUE] Temperature = ");
  Serial.println(pendingTemperature);
  Serial.print("[QUEUE] TraceId      = ");
  Serial.println(pendingTraceId[0] ? pendingTraceId : "N/A");
  Serial.println("[QUEUE] Policy       = LAST COMMAND WINS");
  Serial.println("[QUEUE] State        = WAIT_SETTLE");
  Serial.println("[QUEUE] --------------------------------------------------");
}

// ============================================================
// MQTT callback
// 重要：這裡只解析、記錄、排隊，不直接發 IR。
// ============================================================
void callback(char* topic, byte* payload, unsigned int length) {
  esp_task_wdt_reset();

  uint32_t messageSeq = ++mqttMessageSeq;

  Serial.println();
  Serial.println("============================================================");
  Serial.print("[TRACE][MQTT][#");
  Serial.print(messageSeq);
  Serial.println("] MESSAGE RECEIVED");
  Serial.println("------------------------------------------------------------");

  Serial.print("[TRACE][MQTT][#");
  Serial.print(messageSeq);
  Serial.print("] Topic       = ");
  Serial.println(topic);

  Serial.print("[TRACE][MQTT][#");
  Serial.print(messageSeq);
  Serial.print("] Length      = ");
  Serial.print(length);
  Serial.println(" bytes");

  if (strcmp(topic, mqtt_topic) != 0) {
    Serial.println("[TRACE][MQTT] RESULT = IGNORED_TOPIC");
    Serial.println("============================================================");
    return;
  }

  // ----------------------------------------------------------
  // Raw payload log
  // ----------------------------------------------------------
  Serial.print("[TRACE][MQTT][#");
  Serial.print(messageSeq);
  Serial.println("] Payload     = ");

  size_t logLength = min((size_t)length, MAX_LOG_PAYLOAD - 1);
  for (size_t i = 0; i < logLength; i++) {
    char c = (char)payload[i];
    if (c == '\r' || c == '\n') c = ' ';
    Serial.print(c);
  }
  if (length >= MAX_LOG_PAYLOAD) {
    Serial.print("... [TRUNCATED]");
  }
  Serial.println();

  // ----------------------------------------------------------
  // JSON parse
  // ----------------------------------------------------------
  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, payload, length);

  if (error) {
    Serial.print("[TRACE][MQTT][#");
    Serial.print(messageSeq);
    Serial.print("] RESULT      = JSON_PARSE_ERROR: ");
    Serial.println(error.c_str());
    Serial.println("============================================================");
    return;
  }

  // ----------------------------------------------------------
  // 支援兩種格式：
  // 1. command / temperature
  // 2. Action / Temperature
  // ----------------------------------------------------------
  const char* command = "";

  if (doc["command"].is<const char*>()) {
    command = doc["command"];
  }
  else if (doc["Action"].is<const char*>()) {
    command = doc["Action"];
  }

  int temp = 27;

  if (doc["temperature"].is<int>()) {
    temp = doc["temperature"];
  }
  else if (doc["Temperature"].is<int>()) {
    temp = doc["Temperature"];
  }

  // ----------------------------------------------------------
  // Optional trace ID
  // API 如果未提供，就使用本機 MQTT message #。
  // 支援 requestId / RequestId / traceId / TraceId
  // ----------------------------------------------------------
  const char* traceId = "";

