zzac9ej/SmartAc/ESP32_SmartAC/ESP32_SmartAC.ino
  if (doc["requestId"].is<const char*>()) {
    traceId = doc["requestId"];
  }
  else if (doc["RequestId"].is<const char*>()) {
    traceId = doc["RequestId"];
  }
  else if (doc["traceId"].is<const char*>()) {
    traceId = doc["traceId"];
  }
  else if (doc["TraceId"].is<const char*>()) {
    traceId = doc["TraceId"];
  }

  Serial.print("[TRACE][MQTT][#");
  Serial.print(messageSeq);
  Serial.print("] Action      = ");
  Serial.println(command[0] ? command : "<MISSING>");

  Serial.print("[TRACE][MQTT][#");
  Serial.print(messageSeq);
  Serial.print("] Temperature = ");
  Serial.println(temp);

  Serial.print("[TRACE][MQTT][#");
  Serial.print(messageSeq);
  Serial.print("] TraceId     = ");
  Serial.println(traceId[0] ? traceId : "N/A");

  if (command[0] == '\0') {
    Serial.print("[TRACE][MQTT][#");
    Serial.print(messageSeq);
    Serial.println("] RESULT      = REJECTED_MISSING_ACTION");
    Serial.println("============================================================");
    return;
  }

  if (strcmp(command, "turn_on") == 0) {
    queueCommand("turn_on", temp, messageSeq, traceId);
  }
  else if (strcmp(command, "turn_off") == 0) {
    queueCommand("turn_off", 27, messageSeq, traceId);
  }
  else {
    Serial.print("[TRACE][MQTT][#");
    Serial.print(messageSeq);
    Serial.print("] RESULT      = REJECTED_UNKNOWN_ACTION: ");
    Serial.println(command);
    Serial.println("============================================================");
    return;
  }

  Serial.print("[TRACE][MQTT][#");
  Serial.print(messageSeq);
  Serial.println("] RESULT      = ACCEPTED_TO_QUEUE");
  Serial.println("============================================================");
}

// ============================================================
// Process pending command
// ============================================================
void processPendingCommand() {
  if (!pendingCommandValid) {
    return;
  }

  unsigned long now = millis();

  // ----------------------------------------------------------
  // Settle window
  // ----------------------------------------------------------
  if (now - pendingCommandTime < COMMAND_SETTLE_MS) {
    return;
  }

  // ----------------------------------------------------------
  // IR minimum interval
  // ----------------------------------------------------------
  if (lastIrSendTime != 0 &&
      now - lastIrSendTime < IR_MIN_INTERVAL_MS) {
    return;
  }

  char command[sizeof(pendingCommand)];
  copySafeString(command, sizeof(command), pendingCommand);

  int temp = pendingTemperature;
  uint32_t sourceMessageSeq = pendingMessageSeq;

  char traceId[sizeof(pendingTraceId)];
  copySafeString(traceId, sizeof(traceId), pendingTraceId);

  // 先清除 pending。
  // IR 發射期間如果又收到新 MQTT，會建立新的 pending。
  pendingCommandValid = false;

  Serial.println();
  Serial.println("============================================================");
  Serial.print("[TRACE][QUEUE][MQTT#");
  Serial.print(sourceMessageSeq);
  Serial.println("] READY TO EXECUTE");
  Serial.println("------------------------------------------------------------");

  Serial.print("[TRACE][QUEUE] Command     = ");
  Serial.println(command);
  Serial.print("[TRACE][QUEUE] Temperature = ");
  Serial.println(temp);
  Serial.print("[TRACE][QUEUE] TraceId     = ");
  Serial.println(traceId[0] ? traceId : "N/A");
  Serial.print("[TRACE][QUEUE] Waited      = ");
  Serial.print(now - pendingCommandTime);
  Serial.println(" ms");

  // ----------------------------------------------------------
  // Build IR state
  // ----------------------------------------------------------
  uint64_t state = getAcState(command, temp);

  Serial.print("[TRACE][IR] Source MQTT# = ");
  Serial.println(sourceMessageSeq);
  Serial.print("[TRACE][IR] State        = 0x");
  printHex64(state);
  Serial.println();

  if (strcmp(command, "turn_on") == 0) {
    Serial.print("[TRACE][IR] Action       = TURN_ON ");
    Serial.print(temp);
    Serial.println("C");
  }
  else if (strcmp(command, "turn_off") == 0) {
    Serial.println("[TRACE][IR] Action       = TURN_OFF");
  }
  else {
    Serial.println("[TRACE][IR] ERROR        = UNKNOWN_COMMAND");
    Serial.println("============================================================");
    return;
  }

  // ----------------------------------------------------------
  // Send IR
  // ----------------------------------------------------------
  unsigned long irStart = millis();
  sendCustomKelon(state);
  unsigned long irElapsed = millis() - irStart;

  lastIrSendTime = millis();

  Serial.println("------------------------------------------------------------");
  Serial.print("[TRACE][IR] RESULT       = SENT");
  Serial.print(" | duration = ");
  Serial.print(irElapsed);
  Serial.println(" ms");
  Serial.print("[TRACE][IR] MQTT#        = ");
  Serial.println(sourceMessageSeq);
  Serial.print("[TRACE][IR] TraceId       = ");
  Serial.println(traceId[0] ? traceId : "N/A");
  Serial.println("[TRACE][QUEUE] RESULT     = EXECUTED");
  Serial.println("============================================================");

  esp_task_wdt_reset();
}

// ============================================================
// Wi-Fi setup
// ============================================================
void setupWiFi() {
  Serial.println();
  Serial.println("============================================================");
  Serial.println("[TRACE][WIFI] INITIALIZE");
  Serial.println("------------------------------------------------------------");
  Serial.print("[TRACE][WIFI] SSID = ");
  Serial.println(ssid);

  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.persistent(false);
  WiFi.setSleep(false);
  WiFi.begin(ssid, password);

  unsigned long startTime = millis();

  while (WiFi.status() != WL_CONNECTED &&
         millis() - startTime < 10000UL) {
    delay(250);
    Serial.print(".");
    esp_task_wdt_reset();
  }

  Serial.println();

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("[TRACE][WIFI] RESULT = CONNECTED");
    Serial.print("[TRACE][WIFI] IP     = ");
    Serial.println(WiFi.localIP());
    Serial.print("[TRACE][WIFI] RSSI   = ");
    Serial.print(WiFi.RSSI());
    Serial.println(" dBm");
    wifiDisconnectedSince = 0;
  }
  else {
    Serial.println("[TRACE][WIFI] RESULT = INITIAL_CONNECT_FAILED");
    Serial.println("[TRACE][WIFI] ACTION = AUTO_RECONNECT_IN_LOOP");
  }

