zzac9ej/SmartAc/ESP32_SmartAC/ESP32_SmartAC.ino
  Serial.println("============================================================");
}

// ============================================================
// Wi-Fi reconnect
// ============================================================
void reconnectWiFi() {
  Serial.println();
  Serial.println("[TRACE][WIFI] RECONNECT ATTEMPT");
  Serial.print("[TRACE][WIFI] Status = ");
  Serial.println(WiFi.status());

  WiFi.reconnect();

  esp_task_wdt_reset();
}

// ============================================================
// MQTT reconnect
// ============================================================
void reconnectMQTT() {
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("[TRACE][MQTT] RECONNECT SKIPPED: WIFI_OFFLINE");
    return;
  }

  Serial.println();
  Serial.println("============================================================");
  Serial.println("[TRACE][MQTT] RECONNECT ATTEMPT");
  Serial.println("------------------------------------------------------------");
  Serial.print("[TRACE][MQTT] Broker  = ");
  Serial.print(mqtt_server);
  Serial.print(":");
  Serial.println(mqtt_port);
  Serial.print("[TRACE][MQTT] Topic   = ");
  Serial.println(mqtt_topic);

  char clientId[64];
  uint64_t chipId = ESP.getEfuseMac();
  uint32_t randomPart = esp_random();

  snprintf(clientId,
           sizeof(clientId),
           "ESP32-Kelon-%04X%08X-%08X",
           (uint16_t)(chipId >> 32),
           (uint32_t)chipId,
           randomPart);

  Serial.print("[TRACE][MQTT] Client  = ");
  Serial.println(clientId);

  esp_task_wdt_reset();

  bool connected = client.connect(clientId);

  esp_task_wdt_reset();

  if (connected) {
    Serial.println("[TRACE][MQTT] CONNECT = SUCCESS");

    bool subscribed = client.subscribe(mqtt_topic);

    if (subscribed) {
      mqttDisconnectedSince = 0;
      Serial.println("[TRACE][MQTT] SUBSCRIBE = SUCCESS");
      Serial.print("[TRACE][MQTT] Topic      = ");
      Serial.println(mqtt_topic);
      Serial.println("[TRACE][MQTT] PIPELINE    = READY");
    }
    else {
      Serial.println("[TRACE][MQTT] SUBSCRIBE = FAILED");
      client.disconnect();
    }
  }
  else {
    Serial.print("[TRACE][MQTT] CONNECT = FAILED | state = ");
    Serial.println(client.state());
  }

  Serial.println("============================================================");
}

// ============================================================
// Wi-Fi state management
// ============================================================
void handleWiFi() {
  unsigned long now = millis();

  if (WiFi.status() == WL_CONNECTED) {
    if (wifiDisconnectedSince != 0) {
      Serial.println();
      Serial.println("============================================================");
      Serial.println("[TRACE][WIFI] ★ CONNECTION RESTORED ★");
      Serial.print("[TRACE][WIFI] IP   = ");
      Serial.println(WiFi.localIP());
      Serial.print("[TRACE][WIFI] RSSI = ");
      Serial.print(WiFi.RSSI());
      Serial.println(" dBm");
      Serial.println("============================================================");
      wifiDisconnectedSince = 0;
    }
    return;
  }

  if (wifiDisconnectedSince == 0) {
    wifiDisconnectedSince = now;

    Serial.println();
    Serial.println("============================================================");
    Serial.println("[TRACE][WIFI] !!! DISCONNECTED !!!");
    Serial.println("[TRACE][WIFI] ACTION = AUTO RECOVERY STARTED");
    Serial.println("============================================================");
  }

  if (now - lastWiFiCheckTime >= WIFI_CHECK_INTERVAL) {
    lastWiFiCheckTime = now;
    reconnectWiFi();
  }

  if (now - wifiDisconnectedSince >= WIFI_RESTART_TIMEOUT) {
    Serial.println();
    Serial.println("============================================================");
    Serial.println("[SYSTEM] WIFI RECOVERY TIMEOUT");
    Serial.println("[SYSTEM] Wi-Fi offline for > 5 minutes");
    Serial.println("[SYSTEM] ACTION = ESP.restart()");
    Serial.println("============================================================");
    delay(500);
    ESP.restart();
  }
}

// ============================================================
// MQTT state management
// ============================================================
void handleMQTT() {
  unsigned long now = millis();

  if (WiFi.status() != WL_CONNECTED) {
    return;
  }

  if (client.connected()) {
    mqttDisconnectedSince = 0;

    // 必須高頻率執行。
    client.loop();
    return;
  }

  if (mqttDisconnectedSince == 0) {
    mqttDisconnectedSince = now;

    Serial.println();
    Serial.println("============================================================");
    Serial.println("[TRACE][MQTT] !!! DISCONNECTED !!!");
    Serial.println("[TRACE][MQTT] ACTION = AUTO RECOVERY STARTED");
    Serial.println("============================================================");
  }

  if (now - lastMqttConnectAttempt >= MQTT_RECONNECT_INTERVAL) {
    lastMqttConnectAttempt = now;
    reconnectMQTT();
  }

  if (now - mqttDisconnectedSince >= MQTT_RESTART_TIMEOUT) {
    Serial.println();
    Serial.println("============================================================");
    Serial.println("[SYSTEM] MQTT RECOVERY TIMEOUT");
    Serial.println("[SYSTEM] MQTT offline for > 10 minutes");
    Serial.println("[SYSTEM] ACTION = ESP.restart()");
    Serial.println("============================================================");
    delay(500);
    ESP.restart();
  }
}

// ============================================================
// System status
// ============================================================
void printSystemStatus() {
  unsigned long now = millis();

  if (now - lastStatusReportTime < STATUS_REPORT_INTERVAL) {
    return;
  }

  lastStatusReportTime = now;

  Serial.println();
  Serial.println("============================================================");
  Serial.println("[STATUS] SYSTEM HEALTH");
  Serial.println("------------------------------------------------------------");

  Serial.print("[STATUS] Uptime          = ");
  Serial.print((now - setupTime) / 1000UL);
  Serial.println(" sec");

  Serial.print("[STATUS] Free Heap       = ");
  Serial.print(ESP.getFreeHeap());
  Serial.println(" bytes");

  Serial.print("[STATUS] Min Free Heap   = ");
  Serial.print(ESP.getMinFreeHeap());
  Serial.println(" bytes");

  Serial.print("[STATUS] MQTT Messages   = ");
  Serial.println(mqttMessageSeq);

  Serial.print("[STATUS] IR Transmits    = ");
  Serial.println(irSendSeq);

  Serial.print("[STATUS] WiFi            = ");
  if (WiFi.status() == WL_CONNECTED) {
    Serial.print("CONNECTED | IP=");
    Serial.print(WiFi.localIP());
    Serial.print(" | RSSI=");
    Serial.print(WiFi.RSSI());
    Serial.println(" dBm");
  } else {
    Serial.println("DISCONNECTED");
  }

  Serial.print("[STATUS] MQTT            = ");
  if (client.connected()) {
    Serial.println("CONNECTED");
  } else {
    Serial.print("DISCONNECTED | state=");
    Serial.println(client.state());
  }

  Serial.print("[STATUS] Pending Command  = ");
  if (pendingCommandValid) {
    Serial.print(pendingCommand);
    Serial.print(" | Temp=");
    Serial.print(pendingTemperature);
    Serial.print(" | MQTT#=");
    Serial.print(pendingMessageSeq);
    Serial.print(" | TraceId=");
    Serial.println(pendingTraceId[0] ? pendingTraceId : "N/A");
  } else {
    Serial.println("NONE");
  }

