zzac9ej/SmartAc/ESP32_SmartAC/ESP32_SmartAC.ino
  Serial.println("============================================================");
}

// ============================================================
// Setup
// ============================================================
void setup() {
  Serial.begin(115200);
  delay(500);

  Serial.println();
  Serial.println();
  Serial.println("############################################################");
  Serial.println("# ESP32 KELON AC CONTROLLER");
  Serial.println("# 24/7 STABLE + FULL TRACE LOG");
  Serial.println("# API -> MQTT -> ESP32 -> QUEUE -> IR");
  Serial.println("############################################################");

  // 1. Reset reason 必須最早印。
  printResetReason();

  // 2. Watchdog
  Serial.println("[SYSTEM] Initializing Watchdog...");
  initWatchdog();
  esp_task_wdt_reset();
  Serial.println("[SYSTEM] Watchdog = 15 sec");

  // 3. IR
  Serial.println("[IR] Initializing IR sender...");
  ac.begin();
  rawSender.begin();
  Serial.print("[IR] GPIO = ");
  Serial.println(kIrLed);
  esp_task_wdt_reset();

  // 4. Wi-Fi
  setupWiFi();
  esp_task_wdt_reset();

  // 5. MQTT
  client.setServer(mqtt_server, mqtt_port);
  client.setCallback(callback);
  client.setKeepAlive(30);
  client.setBufferSize(512);
  client.setSocketTimeout(5);

  // 6. Runtime timers
  setupTime = millis();
  lastWiFiCheckTime = millis();
  lastMqttConnectAttempt = 0;
  lastStatusReportTime = millis();
  wifiDisconnectedSince = 0;
  mqttDisconnectedSince = 0;
  lastIrSendTime = 0;
  pendingCommandValid = false;
  mqttMessageSeq = 0;
  irSendSeq = 0;

  randomSeed((uint32_t)esp_random());

  // 7. MQTT initial connect
  if (WiFi.status() == WL_CONNECTED) {
    reconnectMQTT();
  }

  esp_task_wdt_reset();

  Serial.println();
  Serial.println("############################################################");
  Serial.println("# SYSTEM READY");
  Serial.println("# MQTT -> ESP32 -> IR pipeline is ready");
  Serial.println("############################################################");
  Serial.println();
}

// ============================================================
// Loop
// ============================================================
void loop() {
  // 1. Feed Watchdog
  esp_task_wdt_reset();

  unsigned long currentMillis = millis();

  // 2. Optional periodic reboot
  if (REBOOT_INTERVAL_MS > 0 &&
      currentMillis - setupTime >= REBOOT_INTERVAL_MS) {

    Serial.println();
    Serial.println("[SYSTEM] Periodic reboot triggered");
    delay(500);
    ESP.restart();
  }

  // 3. Wi-Fi
  handleWiFi();

  // 4. MQTT
  handleMQTT();

  // 5. IR queue
  processPendingCommand();

  // 6. Health log
  printSystemStatus();

  // 7. Short yield
  delay(5);
}
